"""
task 7.2
Вам дан массив mystery
mystery = np.array([[-13586,  15203,  28445, -27117,  -1781, -17182, -18049],
       [ 25936, -30968,  -1297,  -4593,   6451,  15790,   7181],
       [ 13348,  28049,  28655,  -6012,  21762,  25397,   8225],
       [ 13240,   7994,  32592,  20149,  13754,  11795,   -564],
       [-21725,  -8681,  30305,  22260, -17918,  12578,  29943],
       [-16841, -25392, -17278,  11740,   5916,    -47, -32037]],
      dtype=np.int16)
      
Выполните все пукты задания по порядку.
Пожалуйста, не меняйте названия переменных, 
в которых должны появиться ответы.

В переменную elem_5_3 сохраните элемент из 5 строки и 3 столбца
В переменную last сохраните элемент из последней строки последнего столбца
В переменную line_4 сохраните строку 4
В переменную col_2 сохраните предпоследний столбец
Из строк 2-4 (включительно) получите столбцы 3-5 (включительно). Результат сохраните в переменную part
Сохраните в переменную rev последний столбец в обратном порядке
Сохраните в переменную trans транспонированный массив
"""
import numpy as np

mystery = np.array([[-13586,  15203,  28445, -27117,  -1781, -17182, -18049],
       [ 25936, -30968,  -1297,  -4593,   6451,  15790,   7181],
       [ 13348,  28049,  28655,  -6012,  21762,  25397,   8225],
       [ 13240,   7994,  32592,  20149,  13754,  11795,   -564],
       [-21725,  -8681,  30305,  22260, -17918,  12578,  29943],
       [-16841, -25392, -17278,  11740,   5916,    -47, -32037]],
      dtype=np.int16)

# print(f'mystery={mystery}')
# print('next==')


print('В переменную elem_5_3 сохраните элемент из 5 строки и 3 столбца')
elem_5_3 = mystery[4,2]
print(f'elem_5_3={elem_5_3}')
print('next=')

print('В переменную last сохраните элемент из последней строки последнего столбца')
last = mystery[5,6]
print(f'last={last}')
print('next=')


print('В переменную line_4 сохраните строку 4')
"""
line_4 = mystery[3:4] # not
# Ожидаемый ответ: [13240  7994 32592 20149 13754 11795  -564]
# Ваш ответ: [[13240  7994 32592 20149 13754 11795  -564]]
"""
line_4 = mystery[3,]
print(f'line_4={line_4}')
print('next=')


print('В переменную col_2 сохраните предпоследний столбец')
"""
col_2 = mystery[:, 5:6] # not
# Ожидаемый ответ: [-17182  15790  25397  11795  12578    -47]
# Ваш ответ: [[-17182]
 [ 15790]
 [ 25397]
 [ 11795]
 [ 12578]
 [   -47]]
"""
col_2 = mystery[:, 5]
print(f'col_2={col_2}')
print('next=')


print('Из строк 2-4 (включительно) получите столбцы 3-5 (включительно). Результат сохраните в переменную part')
"""
part = mystery[2:5, 3:6]# not
# Ожидаемый ответ: 
[[-1297 -4593  6451]
 [28655 -6012 21762]
 [32592 20149 13754]]
# Ваш ответ: 
[[ -6012  21762  25397]
 [ 20149  13754  11795]
 [ 22260 -17918  12578]]
"""
part = mystery[1:4, 2:5]
print(f'part={part}')
print('next=')



print('Сохраните в переменную rev последний столбец в обратном порядке')
"""
# rev = mystery[:6,-1]
rev_tmp = mystery[:, 6:]
rev = rev_tmp[::-1]# not
# Ожидаемый ответ: 
[-32037  29943   -564   8225   7181 -18049]
# Ваш ответ: 
[[-32037]
 [ 29943]
 [  -564]
 [  8225]
 [  7181]
 [-18049]]
"""
#1 rev = mystery[:6,-1] # rev=[-18049   7181   8225   -564  29943 -32037]
#2 rev = mystery[:6:-1] # rev=[]
rev_ = mystery[:, 6]
rev = rev_[::-1]
print(f'rev={rev}')
print('next=')


print('Сохраните в переменную trans транспонированный массив')
trans = mystery.transpose()
print(f'trans={trans}')
print('next=')

"""
# Введите свое решение ниже
import numpy as np

mystery = np.array([[-13586,  15203,  28445, -27117,  -1781, -17182, -18049],
       [ 25936, -30968,  -1297,  -4593,   6451,  15790,   7181],
       [ 13348,  28049,  28655,  -6012,  21762,  25397,   8225],
       [ 13240,   7994,  32592,  20149,  13754,  11795,   -564],
       [-21725,  -8681,  30305,  22260, -17918,  12578,  29943],
       [-16841, -25392, -17278,  11740,   5916,    -47, -32037]],
      dtype=np.int16)

elem_5_3 = mystery[4,2]

last = mystery[5,6]

line_4 = mystery[3,]

col_2 = mystery[:, 5]

part = mystery[1:4, 2:5]

rev_ = mystery[:, 6]
rev = rev_[::-1]

trans = mystery.transpose()

"""
