"""
task 10.10
Напишите функцию get_loto(num), 
генерирующую трёхмерный массив 
случайных целых чисел от 1 до 100 (включительно). 
Это поля для игры в лото.

Трёхмерный массив должен состоять 
из таблиц чисел формы 5х5, 
то есть итоговая форма — (num, 5, 5).

Функция возвращает полученный массив.

Пример
get_loto(3)
Результат:
array([[[ 35,  66,  38,  11,  32],
       [ 32,   7,  37,  83,  42],
       [ 89,  37,  19,  51,  89],
       [ 70, 100,  83,   5,  11],
       [ 20,  13,  60,  26,  41]],

      [[ 23,  49,  76,  44,  43],
       [ 59,  63,  99,  92,   2],
       [ 83,   4,  25,  73,  19],
       [ 10,  18,  40,  11,  21],
       [ 58,  45,  73,  93,  61]],

      [[100,  88,  70,  34,  51],
       [  5,  35,  36,  85,  88],
       [ 72,  23,  87,  30,  40],
       [ 29,  21,  51,  73,  81],
       [ 91,  19,  87,  60,  27]]])

"""
import numpy as np

def get_loto(num):
    print(f'    def num={num}=')
    
    array = np.random.randint(1, 101, size=(num, 5, 5))
    print(f'    def array={array}=')
    
    return array

get_loto(3)
