"""
task 2.8
Определите, какая структура данных 
задана по умолчанию в словаре mystery.
Примечание
К сожалению, в Codeboard некорректно работает функция type. 
Попробуйте просто напечатать любой несуществующий элемент
из словаря, чтобы увидеть тип по умолчанию.
"""
# Следующая строка необходима для системной работы редактора.
# В ней импортируются объекты, которые могут вам понадобиться при выполнении некоторых заданий в процессе прохождения курса.
# Не удаляйте этот импорт!
from hidden import *

print(f'mystery=={mystery}==')